Repository: novajhasley/localization-app
Catalog: lib/l10n/app_*.arb
Languages: es

source: English
es: Inglés

source: Spanish
es: Español

source: Hello, user!
es: ¡Hola, usuario!

source: Settings
es: Configuraciones

source: Change Language
es: Cambiar idioma

source: Language preference
es: Preferencia de idioma

# aboutMe
source: Hello! I'm Nova Hasley, a seasoned Full Stack Developer and Certified Scrum Master with over 9 years of experience in building innovative and scalable solutions for mobile, desktop, and web platforms. I thrive in dynamic environments where I can apply my technical expertise and collaborate with cross-functional teams to deliver impactful solutions.
es: ¡Hola! Soy Nova Hasley, un experimentado desarrollador Full Stack y Scrum Master certificado con más de 9 años de experiencia en la creación de soluciones innovadoras y escalables para plataformas móviles, de escritorio y web. Prospero en entornos dinámicos donde puedo aplicar mi experiencia técnica y colaborar con equipos multifuncionales para ofrecer soluciones impactantes.

source: 💻 Technical Proficiency:
es: 💻 Capacidad técnica:

# languages
source: Languages: Dart, Flutter, React, HTML, CSS, JavaScript, Node, Python
es: Idiomas: Dart, Flutter, React, HTML, CSS, JavaScript, Node, Python

# databases
source: Databases: SQL, NoSQL
es: Bases de Datos: SQL, NoSQL

# toolsTechnologies
source: Tools & Technologies: Git, Bash, Firebase, AWS, MongoDB, RESTful APIs, Postman
es: Herramientas y tecnologías: Git, Bash, Firebase, AWS, MongoDB, API RESTful, Postman

# dataAnalysis
source: Data Analysis: Jupyter, Power Bi, Tableau
es: Análisis de Datos: Jupyter, Power Bi, Tableau

# projectManagement
source: Project Management: Agile/Scrum methodologies, Jira, Confluence, Kanban, GitHub
es: Gestión de Proyectos: Metodologías Agile/Scrum, Jira, Confluence, Kanban, GitHub

# contact
source: I am pursuing new opportunities and can be reached through this profile, or by phone at: 830-459-8287.
es: Estoy buscando nuevas oportunidades y me pueden contactar a través de este perfil o por teléfono al: 830-459-8287.

source: Theme
es: Tema

source: Light
es: Luz

source: Dark
es: Oscuro

# aboutApp
source: About the App
es: Acerca de la Aplicación

# appDescription
source: This app was created to showcase the following prompt. I hope you find it enjoyable. I had a great time developing it.
es: Esta aplicación fue creada para mostrar el siguiente mensaje. Espero que lo encuentres agradable. Me lo pasé muy bien desarrollándolo.

source: The Prompt
es: El Aviso

# promptDescription
source: Please create a simple Flutter mobile application that demonstrates the Flutter localization functionality. It should be just one welcome screen with the label “Hello, user!” and a dropdown with two languages - “English” and “Spanish”. Switching the language should apply the selected language to the app.
es: Cree una aplicación móvil de Flutter simple que demuestre la funcionalidad de localización de Flutter. Debería ser solo una pantalla de bienvenida con la etiqueta “¡Hola, usuario!” y un menú desplegable con dos idiomas: “inglés” y “español”. Cambiar el idioma debería aplicar el idioma seleccionado a la aplicación.
